Wedge-myLamgmuirHinshelwood/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          multicomponentFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;


endTime         1000;

deltaT          1;

writeControl    adjustableRunTime;

writeInterval   1000; //0.1;

purgeWrite      5;

writeFormat     ascii;

writePrecision  10;

writeCompression no;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs
(
"libmyLangmuirHinselwood.so"
);

// ************************************************************************* //
