Wedge-myLamgmuirHinshelwood/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
     type            hePsiThermo;
     mixture         multiComponentMixture;
     transport       sutherland;
     thermo          janaf;
     energy          sensibleEnthalpy;
     equationOfState perfectGas;
     specie          specie;
}

species
7
(
CH4      O2       H2       H2O      CO       CO2     N2
)
;

#include "thermo.compressibleGasGRI"

//- - - - - - - - - - - - - - - -
//INERT SPECIE                              
//- - - - - - - - - - - - - - - -
inertSpecie     N2;

// ************************************************************************* //
