Wedge-myLamgmuirHinshelwood/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (5.0 0 0);

boundaryField
{
    inlet
    {

        type            fixedValue;
        value           uniform (5.0 0 0); 
    }
    outlet
    {
        type            zeroGradient; 
    }
    "(exteriorWall|walls)"
    {
        type            fixedValue; 
        value           uniform (0 0 0);
    }
    center
    {
        type            symmetryPlane;
    }
    "frontAndBack_.*"
    {
        type            wedge;
    }    
}



// ************************************************************************* //
