Wedge-myLamgmuirHinshelwood/0/CO
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CO;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    outlet
    {
        type            zeroGradient; 
    }
    "(exteriorWall|walls)"
    {
        type            zeroGradient; 
    }
    center
    {
        type            symmetryPlane;
    }
    "frontAndBack_.*"
    {
        type            wedge;
    }   
}



// ************************************************************************* //
